TBL_trial/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 12.70215; // k= 1.5*(I*U)^2 where I=1%

boundaryField
{
    my-velocity-inlet
    {
        type            fixedValue;
        value           $internalField;

    }

    my-pressure-outlet
    {
        type            zeroGradient; // inletOutlet;
       // inletValue      $internalField;
       // value           $internalField;
 
    }

    my-wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

   "(wedgeplanesFront|wedgeplanesBack)"
    {
        type            wedge;
    } 

    freeSurf
    {
        type            kqRWallFunction;
        value           $internalField;
    }
 
}

// ************************************************************************* //
